{
    "architectures": [
      "MoSTForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "audio_expert_indices": [32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63],
    "auto_map": {
      "AutoConfig": "configuration_MoST.MoSTConfig",
      "AutoModel": "modeling_MoST.MoSTModel",
      "AutoModelForCausalLM": "modeling_MoST.MoSTForCausalLM"
    },
    "aux_loss_alpha": 0.001,
    "bos_token_id": 100000,
    "eos_token_id": 100001,
    "first_k_dense_replace": 1,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 10944,
    "kv_lora_rank": 512,
    "max_position_embeddings": 163840,
    "model_type": "MoST",
    "moe_intermediate_size": 1408,
    "moe_layer_freq": 1,
    "n_group": 1,
    "n_routed_experts": 64,
    "n_shared_experts": 2,
    "norm_topk_prob": false,
    "num_attention_heads": 16,
    "num_experts_per_tok": 6,
    "num_hidden_layers": 27,
    "num_key_value_heads": 16,
    "pretraining_tp": 1,
    "q_lora_rank": null,
    "qk_nope_head_dim": 128,
    "qk_rope_head_dim": 64,
    "rms_norm_eps": 1e-06,
    "rope_scaling": {
      "beta_fast": 32,
      "beta_slow": 1,
      "factor": 40,
      "mscale": 0.707,
      "mscale_all_dim": 0.707,
      "original_max_position_embeddings": 4096,
      "type": "yarn"
    },
    "rope_theta": 10000,
    "routed_scaling_factor": 1.0,
    "scoring_func": "softmax",
    "seq_aux": true,
    "text_expert_indices": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
    "tie_word_embeddings": false,
    "topk_group": 1,
    "topk_method": "greedy",
    "torch_dtype": "bfloat16",
    "transformers_version": "4.33.1",
    "use_cache": true,
    "use_modality_aware_routing": true,
    "v_head_dim": 128,
    "vocab_size": 102400
  }